"""
Завдання 1: Комплексний аналізатор надійності паролів
Реалізуйте програму, яка оцінює стійкість паролів користувача до компрометації.
Кроки виконання:
    1. Імпортуйте ваші персональні дані (ПІБ, варіант) з модуля shared/student.py.
    2. Завантажте вихідний список паролів та критерії згідно з вашим варіантом.
    3. Використовуючи стандартний модуль random, згенеруйте 3 випадкові індекси зі
        списку паролів, візьміть відповідні паролі та додайте їх дублікати в кінець
        початкового списку (таким чином імітується повторне використання паролів).
    4. Оцініть надійність кожного пароля за наступним алгоритмом:
        Заборонений: Якщо пароль входить до списку forbidden_passwords або
            його довжина менша за min_length з критеріїв.
        Слабкий: Якщо пароль не є забороненим і виконує хоча б один з критеріїв
            безпеки (містить хоча б одну цифру, велику літеру, спеціальний символ або
            малу літеру).
        Середній: Якщо пароль відповідає мінімальній довжині та деяким (але не всім)
            критеріям з різних груп символів.
        Сильний: Якщо пароль відповідає абсолютно всім критеріям безпеки
            (довжина, цифра, велика літера, спеціальний символ), але його довжина менша
            за min_length + 4 символів.
        Дуже сильний: Якщо пароль відповідає всім критеріям безпеки, має довжину
            min_length + 4 або більше символів, та є абсолютно унікальним у всьому
            списку паролів.
    5. Виведіть результат аналізу на екран у зручному табличному форматі."""

from random import randint as ran

passwords = [
    "UserPass1!",
    "temp",
    "Cyber$ecur1ty",
    "guest",
    "P0w3rful@Pass",
    "login",
    "Defens3#2023",
    "abc123",
    "Elit3@Secur",
    "demo",
]
criteria = {
    "min_length": 9,
    "require_digits": True,
    "require_upper": True,
    "require_special": True,
}
forbidden_passwords = {"temp", "guest", "login", "demo", "abc123", "user"}

repeats = (ran(0,len(passwords)-1),
           ran(0,len(passwords)-1),
           ran(0,len(passwords)-1))
passwords.extend(ran(0,len(passwords)-1))

for password in passwords:
    pass #check passwords according to set requirements